American
Doctor
French
I
a
abandon
abandoned
abide
abilities
ability
able
abnormal
abolish
abortion
about
above
abroad
absence
absent
absolute
absolutely
absorb
absorbed
absorbing
abstract
abstraction
absurd
abuse
abused
abuses
abusing
abusive
academic
academics
accelerate
accent
accents
accept
acceptable
acceptance
accepted
accepting
accepts
access
accessible
accessing
accident
accidental
accidentally
accidents
accommodate
accommodation
accompanied
accompany
accompanying
accomplish
accomplished
accord
according
accordingly
account
accountant
accountants
accounted
accounting
accounts
accuracy
accurate
accurately
accusations
accuse
accused
accuses
accusing
ace
achieve
achieved
achievement
achievements
achieves
achieving
acid
acknowledge
acknowledged
acknowledges
acknowledging
acorn
acoustic
acquire
acquired
acquires
acquiring
acquisition
across
act
acted
acting
action
actions
activate
activated
active
actively
activities
activity
actor
actors
acts
actual
actually
acute
adapt
adaptation
adapted
adapting
add
added
addict
addicted
addictive
addicts
adding
addition
additional
additions
address
addressed
addresses
addressing
adds
adequate
adjacent
adjust
adjusted
adjusting
adjustment
adjustments
administration
administrative
admiration
admire
admission
admit
admits
admitted
admitting
adopt
adopted
adopting
adoption
adopts
adult
adults
advance
advanced
advances
advancing
advantage
advantages
advent
adventure
adventures
adventurous
adverse
advert
advertise
advertised
advertisement
advertising
adverts
advice
advise
advised
adviser
advisers
advises
advising
advisory
advocate
advocates
aerial
aesthetic
affairs
affect
affected
affecting
affection
affects
afford
afraid
after
afternoon
afternoons
afterwards
again
against
age
aged
agency
agenda
agent
agents
ages
aggressive
ago
agony
agree
agreed
agreeing
agreement
agreements
agrees
agricultural
ahead
aid
aided
aids
aim
aimed
aiming
aims
air
aircraft
airport
akin
alarm
alarming
alarms
album
albums
alcoholic
alert
algebra
algorithms
alien
aliens
align
aligned
alignment
alike
alive
all
allegations
alleged
allegedly
alleges
allergic
alleviate
alliance
allies
allocated
allocation
allow
allowance
allowed
allowing
allows
ally
almost
alone
along
alongside
aloud
alpha
alphabet
already
also
alter
altered
alternate
alternative
alternatives
altogether
always
am
amateur
amaze
amazed
amazing
amazingly
ambassador
amber
ambient
ambitious
amendment
amount
amounts
ample
amplifier
amuse
amused
amusement
amusing
an
analogue
analyses
analysis
analyst
anarchy
anatomy
ancestor
ancestors
ancient
angel
angels
anger
angle
angles
angry
animal
animals
anniversary
announce
announced
announcement
announcements
announces
announcing
annoy
annoyed
annoying
annual
annually
anonymous
another
answer
answered
answering
answers
anthology
anticipate
anticipated
anticipating
anticipation
antidote
antique
anxious
any
anybody
anyone
anything
anyway
anywhere
apart
apathy
apologies
apology
appalling
apparatus
apparent
apparently
appeal
appealing
appeals
appear
appearance
appearances
appeared
appearing
appears
applause
apple
applicable
applicants
application
applications
applied
applies
apply
applying
appoint
appointed
appointment
appointments
appoints
appraisal
appreciate
appreciated
appreciates
appreciating
appreciation
approach
approached
approaches
approaching
appropriate
appropriately
approval
approve
approved
approves
approximately
apt
arcade
arch
architecture
archive
archived
archives
are
area
areas
arena
arguably
argue
argued
argues
arguing
argument
arguments
arise
arm
armed
arming
arms
army
arose
around
arrange
arranged
arrangement
arrangements
arranging
array
arrest
arrested
arresting
arrests
arrival
arrive
arrived
arrives
arriving
arrogance
arrogant
arrow
arrows
art
article
articles
artificial
artist
artistic
artists
arts
as
ashamed
ashes
aside
ask
asked
asking
asks
asleep
aspect
aspects
ass
assault
assemble
assembled
assembling
assembly
assess
assessed
assessing
assessment
asset
assets
assigned
assignment
assignments
assist
assistance
assistant
assisted
assisting
assists
associate
associated
associates
association
associations
assorted
assume
assumed
assuming
assumption
assumptions
assure
assured
assures
astronomer
astronomers
astronomy
at
ate
atheism
atheists
atmosphere
atom
atomic
atoms
atrocities
attach
attached
attachment
attack
attacked
attacking
attacks
attain
attempt
attempted
attempting
attempts
attend
attendance
attendant
attended
attending
attends
attention
attitude
attitudes
attorney
attorneys
attract
attracted
attracting
attraction
attractive
attracts
attributed
attributes
audible
audience
audiences
aunt
authentic
author
authorities
authority
authors
autobiography
automate
automated
automatic
automatically
automobile
autumn
availability
available
average
avoid
avoided
avoiding
avoids
await
awaited
awaiting
awaits
awake
award
awarded
awarding
awards
aware
awareness
away
awful
awkward
axes
axis
babies
baby
back
backbone
backed
background
backgrounds
backing
backs
backward
bacteria
bad
badge
badly
bag
baggage
bags
bake
baked
bakes
baking
balance
balanced
balances
balancing
ball
ballet
ballot
balls
ban
banana
bananas
band
bands
bandwagon
bandwidth
bank
bankrupt
banks
banned
banner
banning
bans
bar
bare
barely
bargain
bark
barking
baroque
barred
barrel
barrier
barriers
bars
base
based
basement
bases
bash
bashing
basic
basically
basics
basis
basket
bass
bat
batch
bath
bathroom
baths
batteries
battery
battle
be
beach
beam
bean
beans
bear
bearded
beards
bearing
bears
beast
beasts
beat
beaten
beating
beats
beautiful
beautifully
beauty
became
become
becomes
becoming
bed
bedroom
beds
beef
been
beer
beers
before
beg
began
begin
beginner
beginners
beginning
begins
begun
behalf
behave
behaved
behaving
behind
being
beings
belief
beliefs
believe
believed
believer
believers
believes
believing
bell
bells
belong
belonged
belonging
belongs
beloved
below
belt
bench
bend
bending
beneath
beneficial
benefit
benefits
bent
beside
best
bet
beta
bets
better
betting
between
beware
beyond
bias
biased
biblical
bicycle
bicycles
bid
bidding
bids
big
bigger
biggest
bigotry
bill
billion
billions
bills
bin
binary
bind
binding
biography
biological
biologist
biology
bird
birds
birth
birthday
biscuit
biscuits
bit
bite
biting
bits
bizarre
black
blackmail
blacks
blade
blades
blame
blamed
blames
blaming
blank
blanket
blanks
blast
blasted
blasting
blasts
blatant
bless
blessed
blessing
blew
blind
blink
bliss
block
blocked
blocking
blocks
blood
bloody
blow
blowing
blown
blows
blue
blues
board
boards
boat
boats
bobs
bodies
body
bog
bogus
boil
boiled
boiling
bold
bolt
bomb
bombed
bombing
bombs
bond
bone
bones
bonus
book
booked
booking
books
bookshop
bookstore
boom
boost
boot
boots
border
bored
boring
born
borne
borrow
borrowed
borrowing
boss
both
bother
bothered
bottle
bottles
bottom
bought
bounce
bound
boundaries
boundary
bounds
bout
bow
bowl
boxes
boys
bracket
brackets
brain
brains
brake
brakes
branch
branches
brand
branded
branding
brands
brass
brave
breach
bread
break
breakdown
breakfast
breaking
breaks
breath
breathe
breathing
bred
breed
breeding
breeds
brethren
brick
bricks
bridge
bridges
brief
briefly
brigade
bright
brighter
brightest
brightly
brightness
brilliant
brilliantly
bring
bringing
brings
broad
broadcast
broadcasting
broadcasts
broke
broken
brother
brothers
brought
browse
browsing
brush
brutal
bubble
buck
bucket
bucks
budget
buffer
bug
bugs
build
building
buildings
builds
built
bulk
bull
bullet
bulletin
bullets
bump
bunch
bundle
burden
buried
burn
burned
burning
burns
burnt
burst
bursting
bursts
bury
bus
buses
business
businesses
bust
busy
butter
buttons
buy
buyer
buyers
buying
buys
by
bypass
bytes
cabbage
cabinet
cable
cables
caffeine
café
cage
cake
cakes
calculate
calculated
calculations
calculator
calculus
calendar
call
called
caller
calling
calls
calm
cam
came
camera
cameras
camp
campaign
campaigning
campaigns
camps
campus
can
cancel
cancels
cancer
candidate
candidates
cans
cap
capabilities
capability
capable
capacity
capital
capitalism
capitalist
capitals
caps
captain
capture
captured
captures
capturing
car
carbon
card
cardboard
cards
care
cared
career
careers
careful
carefully
careless
cares
caring
carpet
carriage
carried
carrier
carries
carrot
carrots
carry
carrying
cars
cartoon
cartoons
cartridge
cartridges
case
cases
cash
cassette
cast
casting
castle
casts
casual
cat
catastrophic
catch
catches
catching
categories
category
cater
catering
cathedral
catholic
cats
cattle
caught
cause
caused
causes
causing
caution
cave
cease
ceiling
celebrate
celebrated
celebrates
celebrating
celebration
cell
cells
cellular
censor
censored
censorship
cent
central
centuries
century
ceremony
certain
certainly
certainty
certificate
chain
chains
chair
chairman
chairs
chalk
challenge
challenged
challenges
challenging
chamber
champagne
champion
chance
chances
change
changed
changes
changing
channel
channels
chaos
chaotic
chap
chapel
chaps
chapter
chapters
character
characteristic
characteristics
characters
charge
charged
charges
charging
charitable
charities
charity
charm
charmed
charms
chart
charter
charts
chase
chased
chases
chasing
chat
chats
chatted
chatting
cheap
cheaper
cheapest
cheat
cheated
cheating
check
checked
checker
checking
checks
cheek
cheer
cheerful
cheers
cheese
chemicals
chemist
chemistry
chess
chest
chestnut
chew
chewing
chicken
chickens
chief
child
childhood
childish
children
chip
chips
chocolate
choice
choices
choir
choose
chooses
choosing
chopped
chopping
chops
choral
chord
chorus
chose
chosen
chuck
chunk
chunks
church
churches
cider
cigarette
cinema
circa
circles
circuit
circuits
circular
circulated
circulating
circulation
circumstances
cite
cited
cites
cities
citing
citizen
citizens
city
civil
claim
claimed
claiming
claims
clarify
clarity
clash
clashes
class
classes
classic
classical
classics
classification
classified
clause
clean
cleaned
cleaner
cleaners
cleaning
cleans
clear
clearance
cleared
clearer
clearing
clearly
clears
clever
click
client
clients
climate
climb
climbed
climbing
climbs
clinic
clinical
clipped
clipping
clips
clock
clocks
clone
clones
close
closed
closely
closer
closes
closest
closet
closing
closure
cloth
clothes
clothing
clouds
club
clubs
clue
clues
cluster
clusters
coach
coal
coat
coats
code
coded
codes
coding
coffee
coherent
coin
coincidence
coins
cold
collaboration
collapse
collapsed
collapses
collar
colleague
colleagues
collect
collected
collecting
collection
collections
collective
collects
college
colleges
colon
colony
column
columns
combat
combination
combinations
combine
combined
combines
combining
come
comedy
comes
comfort
comfortable
comfortably
comic
comics
coming
command
commandments
commands
commence
comment
commentary
commentator
commented
commenting
comments
commercial
commission
commissioned
commissioning
commissions
commit
commitment
commitments
commits
committed
committee
committees
committing
commodity
common
commonly
commons
communal
communicate
communication
communications
communism
communist
communities
community
compact
companies
companion
company
comparable
comparative
compare
compared
compares
comparing
comparison
comparisons
compassion
compatibility
compatible
compelled
compelling
compensation
compete
competed
competence
competent
competes
competing
competition
competitive
competitor
competitors
compilation
compiled
complain
complained
complaining
complains
complaint
complaints
complement
complementary
complete
completed
completely
completes
completing
completion
complex
complexity
complicated
complications
compliment
comply
component
components
compose
composed
composer
composers
composing
composite
composition
compound
comprehend
comprehensive
compressed
compression
compromise
compulsory
computing
concealed
conceived
concentrate
concentrated
concentration
concept
conception
concepts
conceptual
concern
concerned
concerning
concerns
concert
concerto
concerts
conclude
concluded
concludes
conclusion
conclusions
concrete
condemned
condemns
condition
conditional
conditioned
conditioning
conditions
conduct
conducted
conducting
conductor
conducts
conference
conferences
confess
confidence
confident
confidential
configuration
confined
confirm
confirmation
confirmed
confirming
confirms
conflict
conflicting
conflicts
confuse
confused
confusing
confusion
congestion
congratulate
congratulations
conjunction
connect
connected
connecting
connection
connections
conscience
conscious
consciously
consciousness
consecutive
consensus
consent
consequence
consequences
conservation
conservative
conservatives
consider
considerable
considerably
consideration
considerations
considered
considering
considers
consist
consisted
consistency
consistent
consistently
consisting
consists
consolation
console
conspiracy
constant
constantly
constituency
constituents
constitution
constitutional
constraints
construct
constructed
constructing
construction
constructive
consult
consultancy
consultant
consultants
consultation
consulting
consume
consumed
consumer
consuming
consumption
contact
contacted
contacts
contain
contained
container
containing
contains
contemplating
contemporary
contempt
content
contents
contest
context
continent
continually
continuation
continue
continued
continues
continuing
continuity
continuous
continuously
continuum
contour
contract
contracting
contracts
contrary
contrast
contribute
contributed
contributes
contributing
contribution
contributions
contributor
contributors
control
controlled
controller
controllers
controlling
controls
controversial
controversy
convenience
convenient
conveniently
convention
conventional
conventions
conversation
conversations
converse
conversion
conversions
convert
converted
converter
converting
converts
convey
convicted
conviction
convictions
convince
convinced
convincing
cook
cooked
cookie
cookies
cooking
cooks
cool
cooled
cooling
cooperate
cooperation
coordinate
coordination
cope
copied
copies
coping
copper
copy
copying
copyright
core
corn
corner
corners
corporate
corporation
corpse
correct
corrected
correction
corrections
correctly
correlation
correspondent
corridor
corrupt
corruption
cosmic
cost
costing
costly
costs
cotton
cough
could
council
councils
counsel
count
counted
counter
counterpart
counterparts
counting
countless
countries
country
countryside
counts
county
couple
coupled
couples
coupling
courage
courier
course
courses
court
courtesy
courts
cousin
cover
coverage
covered
covering
covers
cow
cows
crack
cracked
cracking
cracks
craft
cramps
crap
crash
crashed
crashes
crashing
crawl
crawling
crazy
cream
create
created
creates
creating
creation
creative
creator
creature
creatures
credibility
credible
credit
credits
creed
creep
crew
cricket
cried
cries
crime
crimes
criminal
criminals
crisis
crisp
crisps
criteria
criterion
critic
critical
criticism
critics
crop
crops
cross
crossed
crosses
crossing
crossroads
crowd
crowded
crowds
crown
crucial
crude
cruel
cruelty
cruise
cruises
cruising
crunch
crush
crushed
crushes
crushing
crying
cryptic
crystal
crystals
cube
cubic
cuckoo
cuddly
cue
culprit
cult
cultural
culture
cultures
cum
cumulative
cup
cupboard
cups
cure
cured
cures
curing
curiosity
curious
curly
currency
current
currently
curriculum
curry
curse
curtain
curtains
curve
curves
custard
custom
customer
customers
customs
cut
cute
cuts
cutting
cycle
cycled
cycles
cycling
cyclist
cyclists
cylinder
daft
daily
damage
damaged
damages
damaging
damn
damned
damp
dance
danced
dances
dancing
danger
dangerous
dangerously
dangers
dare
dares
daring
dark
darkness
darling
dash
dashing
data
database
databases
date
dated
dates
dating
daughter
dawn
day
daylight
days
daytime
dead
deadline
deadly
deaf
deal
dealer
dealers
dealing
deals
dealt
dear
death
deaths
debate
debates
debating
debt
decade
decades
decay
decent
decide
decided
decides
deciding
decision
decisions
deck
declaration
declare
declared
declares
declaring
decline
declined
declines
declining
decrease
decreased
decreasing
dedicate
dedicated
deed
deeds
deemed
deep
deeper
deepest
deeply
default
defeat
defeated
defeating
defeats
defect
defects
defend
defended
defending
defends
defensive
deficiency
define
defined
defines
defining
definite
definitely
definition
definitive
defy
degradation
degree
degrees
deity
delay
delayed
delaying
delays
delete
deleted
deleting
deliberate
deliberately
delicate
delicious
delight
delighted
delightful
delights
deliver
delivered
delivering
delivers
delivery
demand
demanded
demanding
demands
demise
democracy
democratic
demolished
demonstrate
demonstrated
demonstrates
demonstrating
demonstration
demonstrations
denied
denies
dense
density
dentist
deny
denying
department
departments
departure
depend
dependence
dependent
depending
depends
deposit
depressed
depressing
depression
deprived
depth
depths
deputy
derived
descend
descending
describe
described
describes
describing
description
descriptions
desert
deserted
deserve
deserved
deserves
deserving
design
designated
designed
designer
designers
designing
designs
desirable
desire
desired
desires
desk
desktop
despair
desperate
desperately
destination
destined
destroy
destroyed
destroying
destroys
destruction
destructive
detached
detail
detailed
detailing
details
detect
detected
detecting
detection
detective
detector
deter
determination
determine
determined
determines
determining
devastated
devastating
develop
developed
developer
developers
developing
development
developments
develops
device
devices
devoted
diagnosis
diagnostic
diagnostics
diagram
dial
dialogue
diameter
diary
dice
dictator
dictatorship
did
die
died
dies
diesel
diet
differ
difference
differences
different
differential
differentiate
differently
difficult
difficulties
difficulty
dig
digging
digital
digits
dignity
digs
dilemma
dimension
dimensional
dimensions
dine
dining
dinner
dip
diplomatic
dire
direct
directed
directing
direction
directions
directive
directly
director
directors
directory
directs
dirt
dirty
disabled
disagree
disappear
disappeared
disappearing
disappears
disappoint
disappointed
disappointing
disappointment
disappoints
disaster
disasters
disastrous
disc
discarded
discharge
disciplinary
discipline
discount
discounts
discover
discovered
discoveries
discovering
discovers
discovery
discrimination
discs
discuss
discussed
discusses
discussing
discussion
discussions
disease
diseases
disguise
disguised
disgusted
disgusting
dishes
disk
dislike
dismiss
dismissed
dismisses
disorder
display
displayed
displaying
displays
disposable
disposal
disregard
disrupt
disruption
dissertation
distance
distances
distant
distinct
distinction
distinctive
distinguish
distinguished
distortion
distract
distracted
distress
distressed
distribute
distributed
distributing
distribution
district
disturb
disturbance
disturbed
disturbing
ditch
dive
diverse
diversity
diverted
dives
divide
divided
dividing
divine
diving
division
divisions
divorce
do
doctor
doctors
doctrine
document
documentary
documentation
documented
documenting
documents
dodge
doe
does
dog
dogs
doing
dollar
dollars
domain
domestic
dominant
dominate
dominated
dominates
dominating
donate
donated
donates
donating
donation
donations
done
dons
doom
doomed
door
doors
dose
doses
dot
dots
dotted
double
doubled
doubles
doubling
doubt
doubts
down
downhill
downstairs
dozen
dozens
draft
drafted
drafting
drafts
drag
dragged
dragging
dragon
drags
drain
drained
drains
drama
dramatic
dramatically
drank
drastic
drastically
draw
drawing
drawings
drawn
draws
dread
dreaded
dreadful
dream
dreaming
dreams
dress
dressed
dresses
dressing
drew
dried
dries
drift
drill
drink
drinking
drinks
drip
dripping
drive
driven
driver
drivers
drives
driving
drop
dropped
dropping
drops
drove
drown
drowned
drowning
drug
drugs
drum
drums
drunk
drunken
dry
drying
dual
duck
ducks
due
duff
dug
dull
dumb
dump
dumped
dumping
dumps
duration
during
dust
dusty
duties
duty
dying
dynamic
dynamics
each
eager
eagerly
eagle
ear
earlier
earliest
early
earn
earned
earning
earns
ears
earth
ease
easier
easiest
easily
eastern
easy
eat
eaten
eater
eating
eats
eccentric
echo
echoes
ecological
ecology
economic
economical
economically
economics
economies
economy
edge
edges
edit
edited
editing
edition
editions
editor
editorial
editors
edits
educate
educated
education
educational
effect
effective
effectively
effectiveness
effects
efficiency
efficient
efficiently
effort
efforts
egg
eggs
egos
eight
eighteen
eighth
either
elaborate
elderly
elect
elected
election
elections
electoral
electrical
electricity
electron
electronic
electronics
elegant
element
elements
elephant
elephants
elevator
eleven
eligible
eliminate
eliminated
eliminating
elite
else
elsewhere
em
embarrassed
embarrassing
embarrassment
embedded
emerge
emerged
emergency
emerges
emerging
eminent
emit
emotion
emotional
emotionally
emotions
emphasis
empire
employ
employed
employee
employees
employer
employers
employment
empty
enable
enabled
enables
enabling
enclosed
encounter
encountered
encounters
encourage
encouraged
encouragement
encourages
encouraging
end
ended
ending
endings
endless
endlessly
ends
enemies
enemy
energy
enforce
enforced
engage
engaged
engaging
engine
engineer
engineered
engineering
engineers
engines
enhance
enhanced
enhancement
enhances
enhancing
enjoy
enjoyable
enjoyed
enjoying
enjoyment
enjoys
enlightened
enlightening
enormous
enough
ensure
ensures
ensuring
enter
entered
entering
enterprise
enters
entertain
entertained
entertaining
entertainment
enthusiasm
enthusiastic
entire
entirely
entirety
entities
entitled
entity
entrance
entries
entry
envelope
environment
environmental
environments
envy
episode
episodes
equal
equality
equally
equals
equation
equations
equipment
equipped
equivalent
era
erase
erased
error
errors
escape
escaped
escapes
escaping
especially
essay
essays
essence
essential
essentially
establish
established
establishing
establishment
estate
estimate
estimated
estimates
eternal
eternity
ethic
ethical
ethics
ethnic
evaluate
evaluating
evaluation
even
evening
evenings
evenly
event
events
eventual
eventually
ever
every
everybody
everyday
everyone
everything
everywhere
evidence
evident
evil
evolution
evolutionary
evolve
evolved
evolving
exact
exactly
exam
examination
examine
examined
examines
examining
example
examples
exams
exceed
exceeded
exceeding
exceeds
excellent
exception
exceptional
exceptionally
excess
excessive
exchange
exchanged
exchanges
exchanging
excite
excited
excitement
exciting
exclude
excluded
excluding
exclusion
exclusive
exclusively
excuse
excuses
execute
executed
execution
executive
exempt
exercise
exercises
exercising
exhaust
exhausted
exhausting
exhibit
exhibition
exist
existed
existence
existing
exists
exit
exited
exiting
exits
exotic
expand
expanded
expanding
expands
expansion
expect
expectation
expectations
expected
expecting
expects
expedition
expenditure
expense
expenses
expensive
experience
experienced
experiences
experiencing
experiment
experimental
experimenting
experiments
expert
expertise
experts
expire
expired
expires
explain
explained
explaining
explains
explanation
explanations
explicit
exploded
explodes
exploding
exploited
exploration
explore
explored
explores
exploring
explosion
explosions
explosive
export
expose
exposed
exposes
exposing
exposure
express
expressed
expresses
expressing
expression
expressions
expressway
extend
extended
extending
extends
extension
extensions
extensive
extensively
extent
external
extinction
extra
extract
extraction
extracts
extraordinary
extreme
extremely
extremist
eye
eyes
fabric
face
faced
faces
facilitate
facilities
facility
facing
fact
factor
factories
factors
factory
facts
factual
faculty
fail
failed
failing
fails
failure
failures
faint
fair
fairly
fairness
faith
faithful
fake
fall
fallen
falling
falls
false
fame
familiar
families
family
famine
famous
fan
fancy
fans
fantastic
fantasy
far
farm
farmer
farmers
farther
fascinated
fascinating
fascist
fashion
fashionable
fashioned
fashions
fast
faster
fastest
fat
fatal
fate
fathers
fault
faults
faulty
fear
feared
fears
feat
feature
featured
features
featuring
fee
feed
feedback
feeding
feeds
feel
feeling
feelings
feels
fees
feet
fell
fellow
fellows
felt
female
females
feminist
feminists
fence
fender
festival
fetch
fever
few
fewer
fiction
fictional
fiddle
field
fields
fierce
fifteen
fifth
fifty
fight
fighter
fighting
fights
figure
figured
figures
figuring
file
filed
files
filing
fill
filled
filling
fills
film
filmed
filming
films
filter
filtered
filtering
filters
filthy
final
finally
finals
finance
finances
financial
financially
find
finding
findings
finds
fine
fined
finer
fines
finest
finger
fingers
finish
finished
finishes
finishing
fire
fired
fires
firework
fireworks
firing
firm
firmly
firms
first
fiscal
fish
fishes
fishing
fit
fits
fitted
five
fix
fixed
fixes
fixing
flag
flagged
flags
flame
flames
flash
flashes
flashing
flat
flaw
flawed
flaws
fleet
flesh
flew
flexibility
flexible
flies
flight
flip
flipped
flipping
flips
float
floating
floats
flood
flooded
flooding
floods
floor
floors
floppy
flour
flow
flower
flowers
flowing
flown
flows
fluent
fluid
flush
flushing
flute
fly
flying
foam
focus
fold
folded
folder
folding
folds
folk
folks
follow
followed
follower
followers
following
follows
fond
font
fonts
food
foods
fool
fooled
fooling
foolish
fools
foot
football
for
forbidden
force
forced
forces
forcing
forecast
forecasting
forecasts
foreign
foreigners
forest
forests
forever
forget
forgets
forgetting
forgive
forgiven
forgotten
fork
form
formal
formally
format
formation
formats
formed
former
formerly
forming
forms
formula
forth
forthcoming
fortnight
fortunate
fortunately
fortune
forty
forum
forward
forwards
fossil
fought
foul
found
foundation
foundations
founded
founding
fountain
four
fourteen
fourth
fraction
fragile
fragment
fragments
frame
frames
framework
frankly
fraud
freak
freaks
free
freed
freedom
freely
freeway
freeze
freezing
frequencies
frequency
frequent
frequently
fresh
friction
fried
friend
friendly
friends
friendship
fries
frightened
frightening
fringe
frog
frogs
from
front
froze
frozen
fruit
fruits
frustrated
frustrating
frustration
fry
frying
fudge
fuel
fulfilled
fulfilling
full
fuller
fullest
fully
fun
function
functional
functionality
functioning
functions
fund
fundamental
fundamentally
funded
funding
funds
funeral
funnier
funniest
funny
fur
furniture
furry
further
fuse
fusion
future
fuzzy
gain
gained
gaining
gains
galactic
galaxy
game
games
gang
gap
gaps
garage
garbage
garden
gardens
gas
gasoline
gasp
gate
gates
gateway
gather
gathered
gathering
gathers
gave
gear
geared
gearing
gears
gender
gene
general
generally
generate
generated
generates
generating
generation
generations
generator
generators
generic
generous
genes
genetic
genetically
genetics
genius
genocide
genre
gentle
gentleman
gentlemen
gently
genuine
genuinely
geographical
geography
geology
geometry
gesture
get
gets
getting
ghost
giant
gift
gifts
gig
gin
girl
girlfriend
girls
give
given
gives
giving
glad
gladly
glance
glass
glasses
global
globally
glorious
glory
glossy
glove
gloves
glow
glowing
glows
glue
gnome
go
goal
goals
gods
goes
going
gold
golden
golf
gone
good
goodbye
goodies
goods
goody
gorgeous
gospel
gossip
got
gotten
govern
governing
government
governments
governor
gown
grab
grabbed
grabbing
grabs
grace
grade
grades
gradual
gradually
graduate
graduated
graduates
graduating
graduation
grain
grammar
grand
grandfather
grandmother
grant
granted
grants
graph
graphic
graphical
graphics
graphs
grasp
grass
grateful
grave
gravitational
gravity
greasy
great
greater
greatest
greatly
greed
greedy
green
grew
grid
grief
grim
grind
grinding
grip
grips
gross
ground
grounds
group
groups
grow
growing
grown
grows
growth
guarantee
guaranteed
guarantees
guard
guarded
guarding
guards
guess
guessed
guesses
guessing
guest
guests
guidance
guide
guided
guidelines
guides
guiding
guilt
guilty
guinea
gum
gun
guns
gut
guts
gutter
guy
guys
habit
habits
hack
hacked
hacker
hackers
hacking
hacks
had
hail
hair
haircut
hairs
hairy
half
hall
halls
halt
ham
hammer
hand
handbook
handed
handful
handicap
handing
handle
handled
handler
handles
handling
hands
handy
hang
hanged
hanging
hangover
hangs
happen
happened
happening
happens
happier
happiest
happily
happiness
happy
hard
harden
harder
hardest
hardly
hardship
hardware
hardy
harm
harmful
harmless
harmony
harsh
has
hash
hat
hate
hated
hates
hating
hatred
hats
have
having
havoc
hazard
hazards
hazy
he
head
headed
header
heading
headline
headlines
heads
health
healthy
heap
hear
heard
hearing
hears
heart
hearts
heat
heated
heating
heats
heavens
heavier
heaviest
heavily
heavy
heel
heels
height
heights
held
helicopter
hell
helmet
help
helped
helpful
helping
helpless
helps
hence
her
herd
here
heritage
hero
heroes
heroic
heroin
herring
herself
hesitate
hid
hidden
hide
hideous
hides
hiding
hierarchy
high
higher
highest
highlight
highlighted
highlighting
highlights
highly
highway
highways
hilarious
hill
hills
him
himself
hint
hints
hip
hire
hired
hires
hiring
his
historians
historic
historical
historically
history
hit
hits
hitting
hold
holder
holders
holding
holds
hole
holes
holiday
holidays
hollow
holy
home
homes
homosexuality
honest
honestly
honesty
honey
hook
hooked
hooking
hooks
hope
hoped
hopeful
hopefully
hopeless
hopes
hoping
horizon
horizontal
horn
horrible
horribly
horrific
horrifying
horror
horse
horses
hospital
hospitals
host
hostile
hosts
hot
hotel
hour
hours
house
housed
household
houses
housing
however
huge
hugely
humane
humanity
humans
humble
humorous
hundred
hundreds
hungry
hunt
hunted
hunting
hunts
hurry
hurt
hurting
hurts
husband
hut
hydrogen
hypocrisy
hypocrite
hypothesis
hysterical
ice
icon
icons
idea
ideal
ideally
ideals
ideas
identical
identification
identified
identifies
identify
identifying
identity
ideology
idiot
idiots
idle
ignorance
ignorant
ignored
ignores
ignoring
ill
illegal
illegally
illness
illusion
illustrate
illustrated
illustrates
illustrating
illustration
illustrations
image
images
imaginary
imagination
imaginative
imagine
imagined
imagines
imagining
immature
immediate
immediately
immense
immensely
imminent
immortal
impact
impaired
impending
imperative
imperfect
imperial
implement
implementation
implemented
implementing
implications
import
importance
important
importantly
imported
imports
impose
imposed
imposing
impossible
impress
impressed
impression
impressions
impressive
imprisoned
improve
improved
improvement
improvements
improves
improving
in
inability
inaccurate
inadequate
inappropriate
incentive
inch
inches
incidence
incident
incidents
inclined
include
included
includes
including
inclusion
inclusive
income
incoming
incompetent
incomplete
inconvenience
incorporate
incorporated
incorporating
incorrect
increase
increased
increases
increasing
increasingly
incredible
incredibly
indeed
indefinitely
independence
independent
independently
index
indicate
indicated
indicates
indication
indicator
indicators
indictment
indirect
individual
individually
individuals
induced
induction
indulge
industrial
industries
industry
inequality
inevitable
infamous
infant
infected
infection
infinity
inflation
influence
influenced
influences
influencing
influential
info
inform
informal
information
informative
informed
informing
informs
infrastructure
infringement
ingredient
ingredients
inhabitants
inherent
inheritance
inherited
initial
initially
initials
initiated
initiative
injured
injuries
injury
injustice
ink
inner
innocence
innocent
innovation
innovative
input
inputs
insane
insects
insecure
insert
inside
insight
insist
insisted
insists
inspect
inspecting
inspection
inspiration
inspire
inspired
inspires
inspiring
install
installation
installations
installed
installing
installs
instance
instant
instantly
instead
instinct
institution
institutions
instruction
instructions
instrument
instrumental
instruments
insult
insulting
insults
insurance
intact
intake
integral
integrate
integrated
integrating
integration
integrity
intellect
intellectual
intelligence
intelligent
intend
intended
intense
intensity
intensive
intent
intention
intentional
intentionally
intentions
inter
interact
interacting
interaction
interactions
interactive
interest
interested
interesting
interests
interface
interference
interim
intermediate
internal
internally
international
interpret
interpretation
interpreted
interpreting
interrupt
interrupted
intersection
interval
intervals
intervention
interview
interviewed
interviewing
interviews
intimate
into
intolerance
introduce
introduced
introduces
introducing
introduction
introductory
intuitive
invade
invaded
invading
invalid
invaluable
invasion
invent
invented
invention
inventions
inventor
inverted
invest
investigate
investigated
investigates
investigating
investigation
investigations
investment
invisible
invitation
invite
invited
invites
inviting
involve
involved
involvement
involves
involving
ion
iron
ironic
irony
irrational
irrelevant
irresponsible
is
island
islands
isolated
isolation
issue
issued
issues
issuing
it
item
items
its
itself
jacket
jackets
jail
jam
jammed
jamming
jams
jazz
jealous
jeans
jelly
jerk
jet
job
jobs
join
joined
joining
joins
joint
jointly
joints
joke
jokes
joking
jolly
journalist
journalists
journals
joy
judge
judged
judges
judging
juice
jump
jumped
jumping
jumps
junction
jungle
junior
junk
jury
just
justice
justified
justify
juvenile
keen
keep
keeper
keeping
keeps
ken
kept
kernel
kettle
key
keyboards
keys
keywords
kick
kicked
kicking
kicks
kid
kidding
kidnap
kidnapped
kidnapping
kidney
kids
kill
killed
killer
killing
kills
kind
kindly
kindness
kinds
king
kingdom
kings
kiss
kitchen
kits
knee
knees
knew
knife
knock
knocked
knocking
know
knowing
knowledge
known
knows
lab
label
labels
laboratory
labs
lack
lacking
lacks
lad
ladder
ladies
lag
lager
laid
lain
lake
land
landed
landing
landlord
lands
landscape
lane
language
languages
large
largely
larger
largest
laser
lasers
last
lasted
lasting
lasts
late
lately
later
latest
latter
laugh
laughed
laughing
laughs
laughter
launch
launched
launches
launching
law
lawn
laws
lawyer
lawyers
lay
layer
layers
laying
lays
lazy
leach
lead
leader
leaders
leadership
leading
leads
leaf
leaflets
league
leak
lean
leaning
leans
learn
learning
learns
least
leather
leave
leaves
leaving
lecture
lecturer
lectures
led
left
leg
legal
legally
legend
legislation
legitimate
legs
leisure
lemon
lend
lending
length
lengths
lengthy
lens
lenses
lent
less
lesser
lesson
lessons
lest
let
lethal
lets
letter
letters
letting
level
levels
liability
liaison
liberal
liberties
liberty
libraries
library
license
licensed
licenses
licensing
lid
lie
lied
lies
life
lifestyle
lifetime
lift
lifted
lifting
lifts
light
lighted
lighter
lighting
lightly
lightning
lights
liked
likelihood
likely
likes
liking
limb
limbs
limit
limitations
limited
limiting
limits
line
linear
lined
lines
linguistic
lining
link
linked
linking
links
lion
lip
lips
liquid
liquor
list
listed
listen
listened
listener
listening
listens
listing
listings
lists
lit
literal
literally
literary
literature
litter
little
live
lived
lively
liver
lives
living
load
loaded
loader
loading
loads
loan
loans
lobby
local
locally
locals
located
location
locations
lock
locked
locking
locks
lodge
log
logged
logging
logic
logical
logically
logs
lonely
long
longer
longest
look
looked
looking
looks
loop
loops
loose
lords
lorry
lose
loses
losing
loss
losses
lost
lot
lots
loud
louder
loudest
loudly
love
loved
lovely
lovers
loves
loving
low
lower
lowered
lowering
lowers
lowest
loyal
luck
luckily
lucky
luggage
lump
lunatic
lunch
lunchtime
lung
lungs
lurking
lust
luxury
lying
lyric
lyrics
machine
machinery
machines
mad
made
madness
magazine
magazines
magic
magical
magnetic
magnificent
magnitude
mail
mailbox
mailed
mailing
mails
main
mainly
mains
mainstream
maintain
maintained
maintaining
maintains
maintenance
maize
major
majority
make
maker
makers
makes
making
male
males
malicious
man
manage
managed
management
manager
managers
manages
managing
mandate
mandatory
manifestation
manifesto
manipulation
mankind
manned
manner
manning
mans
manual
manufacture
manufactured
manufacturer
manufacturers
manufacturing
many
map
mapped
mapping
maps
margin
marginal
margins
mark
marked
marker
markers
market
marketing
markets
marking
marks
marriage
married
marries
marry
marrying
mask
mass
masses
massive
massively
master
masters
match
matched
matches
matching
mate
material
materials
mathematics
matrix
matter
matters
mature
maximum
may
maybe
mayor
maze
me
meal
meals
mean
meaning
meaningful
meaningless
meanings
means
meant
meantime
meanwhile
measure
measured
measurement
measurements
measures
measuring
meat
mechanic
mechanical
mechanics
mechanism
mechanisms
media
medical
medicine
medieval
medium
meet
meeting
meetings
meets
melody
melt
member
members
membership
memorable
memories
memory
men
mend
mental
mentality
mentally
mention
mentioned
mentioning
mentions
menu
mercury
mercy
mere
merely
merge
merged
merging
merit
merry
mess
message
messages
messed
messing
messy
met
metal
metaphor
meter
meters
method
methods
metric
mice
microwave
midday
middle
midnight
might
mighty
migrate
migrating
migration
mild
mildly
mile
mileage
miles
military
milk
mill
million
millions
mind
minded
minding
minds
mine
mined
mines
minimal
minimalist
minimum
mining
minister
ministers
minor
minorities
minority
mint
minus
minute
minutes
miracle
miracles
miraculous
mirror
mirrors
miserable
misery
misleading
miss
missed
misses
missile
missiles
missing
mission
mist
mistake
mistaken
mistakenly
mistakes
mists
misunderstood
misuse
mix
mixed
mixes
mixing
mixture
mob
mobile
mock
mode
model
models
moderate
modern
modes
modest
modification
modified
module
modules
mole
molecular
molecule
molecules
moment
moments
momentum
monarch
money
monitor
monitored
monitoring
monitors
monkey
monkeys
monochrome
monopoly
monster
monsters
month
monthly
months
mood
moon
moons
moral
morality
morally
morals
more
morning
mornings
moron
morons
mortal
mortality
most
mostly
mother
mothers
motion
motivate
motivated
motivates
motivating
motivation
motive
motor
motors
motorway
motto
mount
mountain
mountains
mounted
mounting
mounts
mouse
mouth
move
moved
movement
movements
moves
movie
movies
moving
much
muck
mud
mugs
multiple
mum
murder
murdered
murderer
murdering
murders
muscle
muscles
museum
museums
music
musical
musician
musicians
must
mutual
my
myself
mysteries
mysterious
mystery
mystic
myth
mythical
mythology
myths
nail
nailed
nails
naive
naked
name
named
names
naming
narrative
narrow
nasty
nation
national
nationally
nations
native
natives
natural
naturally
nature
naughty
near
nearby
nearest
nearly
neat
necessarily
necessary
necessity
neck
need
needed
needing
needle
needles
needless
needs
negative
neglect
neglected
negotiate
negotiating
negotiation
negotiations
nerve
nerves
nervous
nest
nesting
nests
net
nets
network
networking
networks
neural
neutral
never
nevertheless
new
newcomer
newcomers
newer
newest
newly
news
newsletter
newspaper
newspapers
next
nice
nicely
nicer
nicest
nickname
nicks
night
nightmare
nights
nil
nine
noble
nobody
nodes
noise
noises
noisy
nominate
nominated
nominating
none
nonetheless
nonsense
noon
norm
normal
normally
north
northern
nose
noses
nostalgia
notable
note
noted
notes
nothing
notice
noticeable
noticed
notices
noticing
notification
notified
noting
notion
notorious
novel
novels
novelty
novice
now
nowadays
nowhere
nuclear
null
numb
number
numbered
numbers
numerous
nun
nuns
nurse
nurses
nut
nuts
obey
object
objective
objects
obligation
obligatory
obscure
observation
observations
observe
observed
observers
observing
obsessed
obsession
obsolete
obtain
obtained
obvious
obviously
occasion
occasional
occasionally
occasions
occupation
occupied
occupy
occur
occurred
occurrence
occurring
occurs
ocean
odd
oddly
odds
of
off
offended
offender
offenders
offensive
offer
offered
offering
offerings
offers
office
officer
officers
offices
official
officially
officials
offset
offspring
often
oil
old
older
oldest
on
once
one
ones
oneself
ongoing
onion
only
onto
open
opened
opening
openly
opens
opera
operate
operated
operates
operating
operation
operational
operations
operator
operators
opinion
opinions
opponent
opponents
opportunities
opportunity
oppose
opposed
opposes
opposing
opposite
opposition
oppressed
oppression
opt
opted
optic
optical
optimal
optimistic
optimum
option
optional
options
opus
oral
orbit
orbital
orchestral
order
ordered
ordering
orders
ordinary
organ
organic
organs
orient
oriental
orientation
oriented
origin
original
originally
originals
originated
origins
orthodox
other
others
otherwise
ought
our
ours
ourselves
out
outcome
outcomes
outdated
outer
outgoing
outline
outlines
outlining
outlook
output
outrage
outraged
outrageous
outright
outside
outstanding
over
overall
overcame
overcome
overcoming
overdue
overflow
overhead
overload
overlook
overlooked
overlooking
overly
overnight
overseas
overtime
overview
overwhelming
owe
owed
owes
owing
own
owned
owner
owners
ownership
owning
owns
oxygen
ozone
pace
pack
package
packaged
packages
packaging
packed
packet
packets
packing
packs
pad
padded
pads
page
pages
paid
pain
painful
pains
paint
painted
painting
paintings
paints
pair
pairs
palace
pan
panel
panels
panic
pant
pants
paper
paperback
papers
par
parade
paradox
paragraph
parallel
parallels
parameters
paranoid
parent
parents
parity
park
parked
parking
parks
parliament
parody
parrot
part
partial
partially
participant
participants
participate
participated
participates
participating
particle
particles
particular
particularly
parties
partition
partly
partner
partners
parts
party
pass
passage
passages
passed
passenger
passengers
passes
passing
passion
passionate
passive
passport
password
passwords
past
paste
pat
patch
patches
patent
path
pathetic
paths
patience
patient
patients
pattern
patterns
pause
paused
pavement
pay
paying
payment
payments
pays
peace
peaceful
peak
peaks
peanut
peanuts
peasant
peasants
peculiar
pedal
pedestrian
pedestrians
peer
peers
pen
penalties
penalty
pence
pencil
pending
penguin
pennies
penny
pens
people
peoples
per
perceived
percent
percentage
perception
perfect
perfection
perfectly
perform
performance
performances
performed
performing
performs
perhaps
period
periodic
periods
peripheral
permanent
permanently
permission
permit
permits
permitted
perpetual
persist
persistent
person
personal
personalities
personality
personally
personnel
persons
perspective
pet
petrol
petty
pharmacy
phase
phases
phenomena
phenomenon
philosopher
philosophical
philosophy
phone
phones
photo
photograph
photographic
photographs
photos
phrase
phrases
physical
physically
physicist
physics
physiology
pi
piano
pick
picked
picking
picks
picture
pictures
pie
piece
pieces
pig
pigeon
pigs
pile
piles
pill
pills
pilot
pinch
pink
pins
pint
pints
pipe
pipeline
pipes
pit
pitch
pity
pizza
pizzas
place
placed
places
placing
plague
plain
plan
plane
planes
planet
planetary
planets
planned
planning
plans
plant
planted
planting
plants
plaster
plastic
plate
plates
platform
play
played
player
players
playground
playing
plays
plea
pleasant
pleased
pleasing
pleasure
plenty
plot
plots
plotting
plug
plugged
plugs
pocket
pockets
poem
poems
poet
poetic
poetry
poets
point
pointed
pointer
pointers
pointing
pointless
points
poison
poisoned
poisoning
polar
pole
police
policeman
policies
policy
polished
polishing
polite
political
politically
politician
politicians
politics
poll
polls
pollution
pool
poor
poorest
poorly
pop
pope
popped
popping
pops
popular
popularity
populated
population
populations
pork
port
portable
ported
porter
porters
porting
portion
portions
portray
portrayed
ports
pose
posed
poses
posing
position
positioned
positioning
positions
positive
positively
possess
possessed
possession
possibilities
possibility
possible
possibly
post
postage
postal
postcard
posted
poster
posters
posting
postponed
posts
pot
potato
potatoes
potential
potentially
pound
pounds
pour
poured
pouring
pours
poverty
powder
power
powered
powerful
powering
powers
practical
practically
practice
practices
praise
pray
prayed
prayer
prayers
praying
prays
preach
preaching
precautions
precious
precise
precisely
precision
predict
predictable
predicted
predicting
prediction
predictions
predicts
prefer
preference
preferences
preferred
prefers
pregnancy
pregnant
prejudice
preliminary
premature
premise
premises
premium
preparation
prepare
prepared
prepares
preparing
prescribed
prescription
presence
present
presentation
presented
presenting
presents
preserve
preserved
preserves
preserving
president
press
pressed
presses
pressing
pressure
pressures
presumably
pretend
pretending
pretty
prevail
prevent
prevented
preventing
prevention
prevents
preview
previous
previously
price
priced
prices
pricing
pride
priest
priests
primarily
primary
prime
primitive
principal
principle
principles
print
printed
printer
printers
printing
prints
prior
priorities
priority
prison
prisoner
prisoners
privacy
private
privately
privilege
privileged
prizes
pro
probability
probable
probably
problem
problems
procedure
procedures
proceed
proceedings
proceeds
process
processed
processes
processing
processor
processors
produce
produced
producer
producers
produces
producing
product
production
productive
productivity
products
profession
professional
professionals
professor
profile
profiles
profit
profitable
profits
profound
program
programmer
programming
programs
progress
progressing
project
projected
projection
projects
prolonged
prominent
promise
promised
promises
promising
promote
promoted
promotes
promoting
promotion
prompt
prompted
prompts
prone
pronounce
pronounced
proof
proofs
propaganda
proper
properly
properties
property
prophet
proportion
proportions
proposal
proposals
propose
proposed
proposes
proposing
proposition
prose
prosecution
prospect
prospective
prospects
protect
protected
protecting
protection
protects
protein
protest
protocol
protocols
prototype
proud
prove
proved
proven
proves
provide
provided
provides
providing
proving
provision
provisional
provisions
provocative
provoking
proximity
pseudo
psychological
psychologist
psychology
pub
public
publication
publications
publicity
publicly
publish
published
publisher
publishers
publishes
publishing
pudding
pull
pulled
pulling
pulls
pulp
pulse
pulses
pump
pumped
pumping
pumps
pun
punch
punched
punches
punching
punctuation
punish
punished
punishment
puns
punt
pupil
pupils
purchase
purchased
purchases
purchasing
pure
purely
purge
purity
purple
purpose
purposes
pursue
pursuing
pursuit
push
pushed
pushes
pushing
put
puts
putt
putting
puzzle
puzzles
python
qualification
qualifications
qualified
qualifier
qualifiers
qualifies
qualify
qualifying
qualities
quality
quantities
quantity
quantum
quarter
quarters
queen
queens
queries
query
quest
question
questionable
questioned
questioning
questions
queue
queues
queuing
quick
quicker
quickest
quickly
quiet
quietly
quit
quite
quits
quitting
quiz
quota
quotation
quoted
quotes
quoting
rabbit
rabbits
race
raced
races
racial
racing
racism
racist
rack
racket
racks
radar
radiation
radical
radio
radios
radius
rag
rage
raid
raids
rail
railroad
rails
railway
rain
rainbow
rained
raining
rains
raise
raised
raises
raising
ram
rampant
ran
random
randomly
range
ranges
ranging
rank
ranks
rant
rants
rape
rapid
rapidly
rare
rarely
rarest
rash
rate
rated
rates
rather
rating
ratio
rational
rats
rave
raving
raw
ray
razor
re
reach
reached
reaches
reaching
react
reacted
reacting
reaction
reactions
reactor
reacts
read
reader
readers
reading
readings
reads
ready
real
realistic
reality
really
realm
realms
rear
reason
reasonable
reasonably
reasoning
reasons
rebuild
rebuilding
rebuilt
recall
recalled
recalling
recalls
receive
received
receiver
receives
receiving
recent
recently
reception
recipe
recipes
recipient
recipients
reckless
reckon
reclaim
recognition
recommend
recommendation
recommendations
recommended
recommending
recommends
record
recorded
recorder
recording
recordings
records
recover
recovered
recovering
recovers
recovery
recreational
recruit
recruited
recruiting
recruitment
recruits
rectangular
recycle
recycled
recycling
redefining
reduce
reduced
reduces
reducing
reduction
reductions
refer
reference
references
referred
referring
refers
refined
refining
reflect
reflected
reflecting
reflection
reflects
reflex
reform
reformed
reforms
refresh
refreshed
refreshing
refund
refusal
refuse
refused
refuses
refusing
regain
regard
regarded
regarding
regardless
regards
regime
region
regional
regions
register
registered
registering
registration
regrets
regular
regularly
regulation
regulations
reign
reject
rejected
rejection
rejects
relate
related
relates
relating
relation
relations
relationship
relationships
relative
relatively
relatives
relax
relaxed
relaxing
relay
release
released
releases
releasing
relevance
relevant
reliability
reliable
relief
relies
relieve
relieved
religion
religions
religious
relocation
reluctant
rely
relying
remain
remainder
remained
remaining
remains
remarkable
remarkably
remarks
remedy
remember
remembered
remembering
remembers
remind
reminded
reminder
reminding
reminds
reminiscent
remote
remotely
removal
remove
removed
removes
removing
renamed
rend
render
rendered
rendering
renders
rendition
rends
renew
renewed
rent
repair
repaired
repairing
repairs
repeat
repeated
repeatedly
repeating
repeats
replace
replaced
replacement
replaces
replacing
replied
replies
reply
replying
report
reported
reporter
reporting
reports
represent
representation
representative
representatives
represented
representing
represents
reproduction
request
requested
requesting
requests
require
required
requirement
requirements
requires
requiring
rescue
research
researcher
researchers
resemblance
resemble
resembles
reservation
reservations
reserve
reserved
reserves
reset
residence
resident
residents
resign
resignation
resigned
resigns
resist
resistance
resolution
resolve
resolved
resort
resorts
resource
resources
respect
respected
respecting
respective
respectively
respects
respond
responded
responding
responds
response
responses
responsibilities
responsibility
responsible
rest
restart
restaurant
restaurants
rested
resting
restore
restored
restoring
restricted
restriction
restrictions
rests
result
resulted
resulting
results
resume
resumes
resurrection
retail
retain
retained
retaining
retains
retire
retired
retirement
retires
retiring
return
returned
returning
returns
reuse
reveal
revealed
revealing
reveals
revelation
revenge
revenue
reverse
reversed
